secret/valgrind.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-05-15 sam. 20:59 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>valgrind</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Sholde" />
</head>
<body>
<div id="content">
<h1 class="title">valgrind</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orga9f88a1">1. Introduction</a></li>
<li><a href="#orgdbd704c">2. Usage</a></li>
<li><a href="#orgf1b9236">3. Example</a>
<ul>
<li><a href="#orgaf809f2">3.1. Without leak</a></li>
<li><a href="#org7d8e629">3.2. With leak</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orga9f88a1" class="outline-2">
<h2 id="orga9f88a1"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
<b>valgrind</b> is a compilation of many tools. Here we will just use <b>Memcheck</b>
 module which are the <b>default</b>.
</p>
</div>
</div>

<div id="outline-container-orgdbd704c" class="outline-2">
<h2 id="orgdbd704c"><span class="section-number-2">2</span> Usage</h2>
<div class="outline-text-2" id="text-2">
<p>
Compile your program and then run it with valgrind.
</p>

<div class="org-src-container">
<pre class="src src-shell">$ gcc prog.c -o prog
$ valgrind ./prog
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf1b9236" class="outline-2">
<h2 id="orgf1b9236"><span class="section-number-2">3</span> Example</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orgaf809f2" class="outline-3">
<h3 id="orgaf809f2"><span class="section-number-3">3.1</span> Without leak</h3>
<div class="outline-text-3" id="text-3-1">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #ff9eb8;">int</span> <span style="color: #ffa724;">main</span>()
{
  <span style="color: #ff9eb8;">int</span> <span style="color: #ffa724;">a</span>[5];
  <span style="color: #ff2c4b; font-weight: bold;">return</span> 0;
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-shell">$ valgrind ./prog
==<span style="color: #ffa724;">6756</span>== Memcheck, a memory error detector
==<span style="color: #ffa724;">6756</span>== Copyright (C) 2002-2017, and GNU GPL<span style="color: #f4cf86;">'d, by Julian Seward et al.</span>
<span style="color: #f4cf86;">==6756== Using Valgrind-3.16.1 and LibVEX; rerun with -h for copyright info</span>
<span style="color: #f4cf86;">==6756== Command: ./a.out</span>
<span style="color: #f4cf86;">==6756== </span>
<span style="color: #f4cf86;">==6756== </span>
<span style="color: #f4cf86;">==6756== HEAP SUMMARY:</span>
<span style="color: #f4cf86;">==6756==     in use at exit: 0 bytes in 0 blocks</span>
<span style="color: #f4cf86;">==6756==   total heap usage: 0 allocs, 0 frees, 0 bytes allocated</span>
<span style="color: #f4cf86;">==6756== </span>
<span style="color: #f4cf86;">==6756== All heap blocks were freed -- no leaks are possible</span>
<span style="color: #f4cf86;">==6756== </span>
<span style="color: #f4cf86;">==6756== For lists of detected and suppressed errors, rerun with: -s</span>
<span style="color: #f4cf86;">==6756== ERROR SUMMARY: 0 errors from 0 contexts (suppressed: 0 from 0)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org7d8e629" class="outline-3">
<h3 id="org7d8e629"><span class="section-number-3">3.2</span> With leak</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Here we don't <b>release</b> the pointer <b>a</b>.
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #aeee00;">#include</span> <span style="color: #f4cf86;">&lt;stdlib.h&gt;</span>

<span style="color: #ff9eb8;">int</span> <span style="color: #ffa724;">main</span>()
{
  <span style="color: #ff9eb8;">int</span> *<span style="color: #ffa724;">a</span> = malloc(<span style="color: #ff2c4b; font-weight: bold;">sizeof</span>(<span style="color: #ff9eb8;">int</span>) * 5);
  <span style="color: #ff2c4b; font-weight: bold;">return</span> 0;
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-shell">$ valgrind ./a.out 
==<span style="color: #ffa724;">6831</span>== Memcheck, a memory error detector
==<span style="color: #ffa724;">6831</span>== Copyright (C) 2002-2017, and GNU GPL<span style="color: #f4cf86;">'d, by Julian Seward et al.</span>
<span style="color: #f4cf86;">==6831== Using Valgrind-3.16.1 and LibVEX; rerun with -h for copyright info</span>
<span style="color: #f4cf86;">==6831== Command: ./a.out</span>
<span style="color: #f4cf86;">==6831== </span>
<span style="color: #f4cf86;">==6831== </span>
<span style="color: #f4cf86;">==6831== HEAP SUMMARY:</span>
<span style="color: #f4cf86;">==6831==     in use at exit: 20 bytes in 1 blocks</span>
<span style="color: #f4cf86;">==6831==   total heap usage: 1 allocs, 0 frees, 20 bytes allocated</span>
<span style="color: #f4cf86;">==6831== </span>
<span style="color: #f4cf86;">==6831== LEAK SUMMARY:</span>
<span style="color: #f4cf86;">==6831==    definitely lost: 20 bytes in 1 blocks</span>
<span style="color: #f4cf86;">==6831==    indirectly lost: 0 bytes in 0 blocks</span>
<span style="color: #f4cf86;">==6831==      possibly lost: 0 bytes in 0 blocks</span>
<span style="color: #f4cf86;">==6831==    still reachable: 0 bytes in 0 blocks</span>
<span style="color: #f4cf86;">==6831==         suppressed: 0 bytes in 0 blocks</span>
<span style="color: #f4cf86;">==6831== Rerun with --leak-check=full to see details of leaked memory</span>
<span style="color: #f4cf86;">==6831== </span>
<span style="color: #f4cf86;">==6831== For lists of detected and suppressed errors, rerun with: -s</span>
<span style="color: #f4cf86;">==6831== ERROR SUMMARY: 0 errors from 0 contexts (suppressed: 0 from 0)</span>
</pre>
</div>
</div>
</div>
</div>
</div>
</body>
</html>
